'''
Напишете програма , в която потребителя въвежда 
текст и на негова база се създава речник. 
За ключове на речника служат символите от текста, 
а стойността на елементите се определя 
от броя на съответните символи в текста.  

Примерен вход :  SSWTWWTAAA  

Речникът ще се състои от 4 елемента :  
 А:3     S:2       T:2     W:3  
'''

text = input('Type your text: ')
s = set()
d = dict()

for i in text:
    s.add(i)

for i in s:
    d[i] = 0

for i in text:
    if i in s:
        d[i] += 1

print(d)